{
  "main": {
    "name": "Devin Osborne",
    "occupation": "Software Engineer, Entrepreneur, and Innovator",
    "description": "Developer by Day, Founder & Entrepreneur by Night. #builtdifferent",
    "image": "IM_Devin.jpg",
    "bio": "I am an entrepreneur at heart, with an incredible passion for innovation, an everlasting desire for knowledge, and a hope to impact the world. Born in the small town of Quincy, Illinois, I moved to Birmingham, Alabama to attend Samford University. While studying marketing and business, I spent an overwhelming amount of time focused on technology and software engineering. I love to build things, and I love to help others. I often work past the point of exhaustion, but I never tire. I have a longing passion to be a public speaker alongside my business innovations and technology habits. My mission: to create something that causes as much impact as the iPhone.",
  
    "contactmessage": "Get in touch with me to receive further details, get coached or anything else.",
    "email": "devin@fatbacksbbq.com",
    "phone": "217.779.1753",
    "address": {
      "street": "910 N 27th St",
      "city": "Quincy",
      "state": "Illinois",
      "zip": "62301"
    },
    "website": "http://fatbacksbbq.com",
    "resumedownload": "/images/Devin_Osborne_Resume_v2.pdf",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/devin.osborne.9847",
        "className": "fa fa-facebook"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/devin-osborne-00b42617a/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/devinlosborne/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/DOZBORNE",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "My work as a developer has spanned from the very beginnings of wordpress web development, all the way to creating mobile applications for Android and iOS. I most enjoy solving problems that seem rather unsolvable, it's the epitome of competition–I refuse to let the problem beat me. My primary experience actually resides in the business world–Marketing and Data Analytics. But I quickly realized the people who actually control marketing are those that make it up: the developers and the designers. So, I eagerly set out to become not just a businessman, but a marketer who has the knowledge to actually market.",
    "education": [
      {
        "school": "Samford University",
        "degree": "Major: Business Administration, B.S. (Marketing)",
        "graduated": "May 2021",
        "description": "Upon a passion to learn, my academic achievement allowed me to join Samford University's honors college to study business and music. After a freshman year, I realized I had little time to invest in music if I wished to fully dive into business software engineering. In my free time, I invested nearly every hour of the day to working on projects and businesses. It was during these times when I discovered the power of thinking differently."
      }
    ],
    "work": [
      {
        "company": "University Fancards",
        "title": "Software Developer & Creative, Intern",
        "years": "Spring 2019 - Spring 2021",
        "description": "At University Fancards, we are changing the way people pay. I was brought on as a volunteer intern looking to exchange my time for education and rapid learning. Over my time at University Fancards, I learned everything from mass-market advertising to implementing native APIs. The primary projects I worked on was building a data dashboard app, implementing a store locator witholding nearly 10,000 locations, and working on our products primary website. Leveraged Learning: React JS, Node JS, JavaScript, PHP, SQL, Python, AWS, APIs."
      },
      {
        "company": "Fatbacks BBQ",
        "title": "Marketing & Technology Director",
        "years": "June 2012 - Current",
        "description": "Fatbacks BBQ is a up-and-coming restaurant that changes people's days one plate at a time by creating food with flavor. Responsibilities & Achievements: Planned and executed the rebranding of the company. This entailed creating a brand guide for the company as well as refacing the entire company's brand physically and online. This contributed to the 40% increase in sales over a years time and our overall brand awareness levels. Planned and implemented the company's overall marketing strategy, including demographic identification, online advertising, campaigning, analytics reporting, photography, graphic design and social media marketing. This lead to a doubling of social followers on platforms like Facebook and a 40% revenue increase from the previous year. 30% of this additional revenue was driven from online sales conversions. Developed Online Ordering Platform & Website. This consisted of both the setup, design, development, and continual updating of the website platform. Crafting everything on the website from taking the photos and editing them to choosing the color scheme and font selection. Controlled and posted to all social media accounts, raising our engagement over 150% for a continual 8 month period. Generating fresh and new content including starting a podcast (Storytime with Devin), raffles, giveaways, and educational tips."
      },
      {
        "company": "Intellectual Brand",
        "title": "Founder & CEO",
        "years": "August 2018 - May 2021",
        "description": "Intellectual Brand is a startup marketing and brand agency that focuses on taking ideas from brain to reality. Responsibilities & Achievements: Founded and CEO. Grew revenue and clientele year over year by ≈ 25%. Focusing on aiding businesses who needed help with establishing a noticable and engaging brand. In charge of monitoring up to 6 clients at once. Client work consisted of web development, business strategy advising, marketing in all facets and avenues, advertising, and branding. Developed a scalable business strategy and partnerships that allowed for growth in the midst of college."
      }
    ],
    "skills": [
      {
        "name": "JavaScript",
        "level": "85%"
      },
      {
        "name": "ReactJs",
        "level": "85%"
      },
      {
        "name": "React Native",
        "level": "55%"
      },
      {
        "name": "Angular",
        "level": "40%"
      },
      {
        "name": "Python",
        "level": "30%"
      },
      {
        "name": "SQL",
        "level": "30%"
      },
      {
        "name": "CSS",
        "level": "80%"
      },
      {
        "name": "AWS",
        "level": "70%"
      },
      {
        "name": "Adobe Illustrator & Photoshop",
        "level": "80%"
      },
      {
        "name": "Integromat",
        "level": "60%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Fatbacks BBQ Website & Ordering Platform",
        "category": "BBQ restaurant website with a focus on online ordering",
        "image": "fb-home.jpg",
        "url": "https://fatbacksbbq.com"
      },
      {
        "title": "Los Molcajetes Mexican Restaurant Website",
        "category": "Mexican restaurant website used to bring in traffic to the store",
        "image": "los-rest.jpg",
        "url": "https://losmolcajetesquincy.com"
      },
      {
        "title": "Fancards Store Locator Map & Website",
        "category": "",
        "image": "fancards map.png",
        "url": "https://map.myfancard.com/"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Devin is one of the hardest workers I know. Nothing stops him from achieving greatness. He's truly outstanding!",
        "user": "Dan Cook"
      },
      {
        "text": "If you need somebody to do quality work, it's this guy. I have known Devin but a few years, but everything he has done for me has put me on top!",
        "user": "Tim Barnes"
      }
    ]
  }
}